
input: "data"
input_dim: 1
input_dim: 1
input_dim: 3
input_dim: 4

input: "offset"
input_dim: 1
input_dim: 18
input_dim: 3
input_dim: 4

layer{
    name: "dconv"
    type: "DeformableConvolution"
    bottom: "data"
    bottom: "offset"
    top: "dconv"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 1
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler{
            type: "constant"
            value: 0
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
    loss_weight: 1
}
